[{"name":"Adrianne","alias":"Light of Justice","rarity":"Epic","type":"Angel","class":"Defender","gearType":"STR","skills":[{"name":"Evil-Ending Spear of Judgment","skillType":"Ultimate","content":"The power of justice pierces through the enemies. Moves towards the enemy with the highest ATK, dealing damage equal to 300% to targets within 3m, and then lifts the target into the air.","upgrades":"Upgrade 1: Damage changes to 330%.  Upgrade 2: Damage changes to 360%. Adds an effect which stuns targets within range for 3 sec. "},{"name":"Torrent of Briliiance","skillType":"Main","content":"Creates a holy explosion, dealing damage equal to 170% ATK in a 3m range around her, and recovers HP of allies within range equal to 100% of ATK.","upgrades":"Upgrade 1: Damage changes to 190% and recovery to 110%.  Upgrade 2: Damage changes to 210% and recovery to 120%. Adds an effect which stuns enemy target for 2 sec. "},{"name":"Ring of Brilliance","skillType":"Sub","content":"Throws a ring of light, dealing damage equal to 130% of ATK to the farthest enemy, stunning it for 2 seconds, and then drags the enemy in front of you.","upgrades":"Upgrade 1: Damage changes to 145%.  Upgrade 2: Damage changes to 160%. Adds an effect which electrocutes target, dealing damage equal to 50% of ATK every 2 sec for 6. "},{"name":"Proclamation of Sanctuary","skillType":"Sub","content":"Creates a sanctuary with a 2.5m area for 10 seconds. Enemies inside the sanctuary receive damage equal to 60% of ATK every 2 seconds, and restores HP of allies by 30% of ATK.","upgrades":"Upgrade 1: Damage changes to 70% and recovery to 35%.  Upgrade 2: Damage changes to 75% and recovery to 37.5%. Creates a protective shield which absorbs damage equal to 150% of ATK for 10 sec. when the sanctuary is created. "},{"name":"Righteous Determination","skillType":"Passive","content":"The more enemies there are, the stronger Adrianne gets. Adrianne's ATK increases by 12% per each enemy within 3.5m around Adrianne.","upgrades":"Upgrade 1: ATK Increase changes to 14%.  Upgrade 2: ATK Increase changes to 16%. "}]},{"name":"Aira","alias":"Wild Beast","rarity":"Epic","type":"Beast","class":"Warrior","gearType":"STR","skills":[{"name":"Great Death Sentence","skillType":"Ultimate","content":"Strikes a full blow that deals damage equal to 240% of Aira's ATK to the nearest enemy and enemies within 3m of the target. Deals additional damage equal to 25% of max HP and recovers her HP by 25%.","upgrades":"Upgrade 1: Damage changes to 260% of ATK additional carnage changes to 27.5% of max HP recovery changes to 27.5%.  Upgrade 2: Damage changes to 280% of ATK additional carnage changes to 30% of max HP recovery changes to 30%. Adds an effect which stuns the target for 3 seconds. "},{"name":"Between Life and Death","skillType":"Main","content":"Resonates the rune of life and rune of death. dealing damage equal to 180% of Aira's ATK to the nearest enemy, stunning it for 2 seconds. When Aira's HP is 50% or more deals additional damage equal to 25% of Aira's max HP to the target, and if it is 50% or less, recovers HP by 25%.","upgrades":"Upgrade 1: Damage changes to 200% of ATK additional damage changes to 27.5% max HP and recovery changes to 27.5% of max HP.  Upgrade 2: Damage changes to 220% of ATK additional damage changes to 30% max HP and recovery changes to 30% of max HP. Conditions for dealing additional damage changes to when HP is 35% or more, and conditions for HP recovery changes to when it is at 65% or less. "},{"name":"Rune of Death","skillType":"Sub","content":"Activates the rune of death to strike the enemy, dealing damage equal to 130% of Aira's max HP. When Aira's HP is 50% or more, deals additional damage equal to 20% of Aira's max HP.","upgrades":"Upgrade 1: Damage changes to 140% of ATK. additional damage changes to 22.5% of max HP.  Upgrade 2: Damage changes to 150% of ATK. additional damage changes to 25% of max HP. Conditions for dealing additional damage changes to when HP is 35% or more. "},{"name":"Rune of Life","skillType":"Sub","content":"Activates the rune of life to attack the nearest enemy, dealing damage equal to 130% of ATK. When Aira's HP is 50% or less, recovers HP by 20%.","upgrades":"Upgrade 1: Damage changes to 130% of ATK recovery changes to 22.5%.  Upgrade 2: Damage changes to 130% of ATK recovery changes to 25%. Conditions for HP recovery changes to when HP is 65% or less. "},{"name":"Rune of Decline","skillType":"Passive","content":"Uses the power of the rune of death to weaken the enemy. Deals a special debuff that reduces the nearest enemy's DEF, physical resistance, and magic resistance by 18% for 10 seconds.","upgrades":"Upgrade 1: DEF. Physical Resistance, Magic Resistance decreases change to 21%.  Upgrade 2: DEF. Physical Resistance, Magic Resistance decreases change to 24%. "}]},{"name":"Ayame","alias":"Waiting for Nirvana","rarity":"Epic","type":"Demon","class":"Caster","gearType":"INT","skills":[{"name":"Sharp Scratching Shadow","skillType":"Ultimate","content":"Ayame in the mirror attacks the enemy. Deals damage equal to 270% of ATK to the nearest enemy in a 2.5m circular area and makes it bleed, dealing damage equal to 80% of ATK for 8 seconds.","upgrades":"Upgrade 1: Damage changes to 295% bleeding damage changes to 85%.  Upgrade 2: Damage changes to 320% bleeding damage changes to 90%. Deals additional 100% damage if the target is already bleeding. "},{"name":"Blooming Darkness","skillType":"Main","content":"Summons a hand of shadow to deal damage equal to 180% ATK to enemies in a 4.6m wide and 7m long area in front and make them bleed, dealing damage equal to 65% ATK every 2 seconds for 8 seconds.","upgrades":"Upgrade 1: Damage changes to 190% bleeding damage changes to 70%.  Upgrade 2: Damage changes to 190% bleeding damage changes to 70%. Deals additional 150% damage if the target is already bleeding. "},{"name":"Winding Grip","skillType":"Sub","content":"Binds enemies with the shadow. Targets the nearest enemy and the surrounding area, binding enemies within 2m of the targeted enemy for 8. Also causes bleed, inflicting damage equal to 60% ATK every 2 seconds.","upgrades":"Upgrade 1: Bleeding damage changes to 65%.  Upgrade 2: Bleeding damage changes to 70%. Effect area changes to 2.5m. "},{"name":"Encroaching Night","skillType":"Sub","content":"Creates a shadow-encroached area, dealing damage equal to 70% of ATK to the nearest enemy and enemies within 2m around it. Also creates an \"Encroached Area\" that deals damage equal to 70% of ATK every 2 seconds for 8 seconds.","upgrades":"Upgrade 1: Damage changes to 75%. DoT changes to 75%.  Upgrade 2: Damage changes to 80%. DoT changes to 80%. The Encroached Area deals 120% additional damage to bleeding enemies. "},{"name":"Alluring Mirror","skillType":"Passive","content":"Those who look at the mirror are charmed. Charms the enemy with the highest ATK for 6 seconds.","upgrades":"Upgrade 1: Charm duration changes to 8 seconds.  Upgrade 2: Increases ATK of Charmed enemies by 100% throughout the duration. "}]},{"name":"Catherine","alias":"Holy Spirit's Touch","rarity":"Epic","type":"Human","class":"Supporter","gearType":"STR","skills":[{"name":"Kyrie","skillType":"Ultimate","content":"Blesses all allies through fancy ceremony and prayer. Recovers HP of all allies by 150% of ATK and creates shields that absorbs damage equal to 25% of Catherine's max HP lasting for 12 sec.","upgrades":"Upgrade 1: HP recovery changes to 175%, shield HP changes to 30%.  Upgrade 2: HP recovery changes to 200%, additionally increases physical/magic resistance by 20%. "},{"name":"Gloria","skillType":"Main","content":"Uses holy power to grant the blessing of protection to allies. Applies a shield to nearby allies that absorbs damage equal to 12% of Catherine's max HP for 10 seconds.","upgrades":"Upgrade 1: Shield HP changes to 14% of max HP.  Upgrade 2: Shield HP changes to 16% of max HP, recovers HP equal to 150% of ATK. "},{"name":"Agnus Dei","skillType":"Sub","content":"Spreads a blessing that protects allies from danger. Increases all allies' DEF by 20% for 12 seconds.","upgrades":"Upgrade 1: DEF increase changes to 23%.  Upgrade 2: DEF increase changes to 26%, recovers additional 1000 Mana. "},{"name":"Credo","skillType":"Sub","content":"Prays for the safety of allies through devout prayer. Blesses the surrounding area for seconds to make allies invincible and restore their HP equal to 100% of ATK.","upgrades":"Upgrade 1: Recovery changes to 115% of ATK.  Upgrade 2: Recovery changes to 130% of ATK and Catherine becomes immune to all hindering effects during prayer. "},{"name":"Sanctus","skillType":"Passive","content":"Catherine's blessing protects allies in danger. When Catherine is on the battlefield, physical and magic resistance of all allies with 35% or less HP increase by 30%.","upgrades":"Upgrade 1: Physical and Magic Resistance increase changes to 35%.  Upgrade 2: Physical and Magic Resistance increase changes to 40%. "}]},{"name":"Cherrie","alias":"Sparkling Pistol","rarity":"Epic","type":"Human","class":"Ranger","gearType":"DEX","skills":[{"name":"Super Spiritus","skillType":"Ultimate","content":"Blows up a liquor bottle containing refined alcohol to inflict damage equal to 230% of ATK to the enemies in a 7m long, 60 degree conical area and makes them Burn, which inflicts damage equal to 65% of ATK every 2 seconds for 8 seconds.","upgrades":"Upgrade 1: Damage changes to 250%, Burn damage changes to 70%.  Upgrade 2: Damage changes to 270%, Burn damage changes to 75%, and Burn duration changes to 10 seconds. "},{"name":"Kiss of Fire","skillType":"Main","content":"Fires alcohol through the heated muzzle to create flames. Deals damage equal to 180% of ATK to enemies in a 2.5m wide and 6.5m long area in front of the nearest enemy and burns them, dealing damage equal to 60% of ATK every 2 seconds for 8 seconds.","upgrades":"Upgrade 1: Damage changes to 210%, Burn damage changes to 65%.  Upgrade 2: Damage changes to 240%, Burn damage changes to 70%, and Burn duration changes to 10 seconds. "},{"name":"Hot Shot","skillType":"Sub","content":"Fires rounds that explode when heated to the nearest enemy and deals damage equal to 160% of ATK. Deals additional 100% damage if the target is burning.","upgrades":"Upgrade 1: Damage changes to 175% of ATK, additional damage changes to 110% of ΑΤΚ.  Upgrade 2: Damage changes to 190% of ATK, additional damage changes to 120% of ATK. If the target is burning, healing High Tension received is reduced by 50% for 8 seconds. "},{"name":"High Tension","skillType":"Sub","content":"When you get drunk from drinking, you get reckless in battle. ATK increases by 15% without duration limit, DEF and Evasion decrease by 15%.","upgrades":"Upgrade 1: ATK increases by 17.5% DEF and Evasion decrease changes to 17.5%.  Upgrade 2: ATK increases by 20% DEF and Evasion decrease changes to 20%. When reaching 3 stacks of the High Tension buff adds the \"Dizzy\" special buff, additionally increasing ATK by 20%. "},{"name":"Fire Bullet","skillType":"Passive","content":"Fires burning bullets. Normal attacks have a 20% chance to burn enemies, dealing damage equal to 55% of ATK every 2 seconds for 6 seconds.","upgrades":"Upgrade 1: Burn damage changes to 60%.  Upgrade 2: Burn damage changes to 60%, activation rate changes to 30%. "}]},{"name":"Chloe","alias":"Shield of Loyalty","rarity":"Epic","type":"Fairy","class":"Defender","gearType":"STR","skills":[{"name":"Shield of Thunder and Storm","skillType":"Ultimate","content":"A blow that strikes enemies like a meteor, dealing damage equal to 300% of DEF to the nearest enemy and enemies within a 2.5m radius, knocking them down and stunning them for 2.5 seconds.","upgrades":"Upgrade 1: Damage changes to 350%.  Upgrade 2: Damage changes to 400%, Stun duration changes to 4 seconds. "},{"name":"Leap of Perseus","skillType":"Main","content":"Exerts massive power like a bull, dealing damage equal to 250% of DEF to enemies in a 2.5m radius and knocks them down.","upgrades":"Upgrade 1: Damage changes to 280%.  Upgrade 2: Damage changes to 310%. Adds an effect which stuns target for 2.5 sec. "},{"name":"Impenetrable Fortress","skillType":"Sub","content":"Protects herself with an impenetrable iron wall. Increases DEF by 25% for 8 seconds, becomes immune to status effects and knockback effects, and taunts all enemies to attack her.","upgrades":"Upgrade 1: DEF increase changes to 27.5%.  Upgrade 2: DEF increase changes to 40%, changes effect's duration to 10 seconds. "},{"name":"Dragon Punch","skillType":"Sub","content":"Hits the nearest enemy and deals damage equal to 180% of DEF and launches the enemy into the air.","upgrades":"Upgrade 1: Damage changes to 200%.  Upgrade 2: Damage changes to 220%. Adds an effect which decreases the target's ATK by 20% for 8 sec. "},{"name":"Fortitude","skillType":"Passive","content":"Chloe's potential manifests when faced with crisis. If her HP falls to 35% or less, increases physical resistance by 40% and magic resistance by 40% for 14 seconds, and HP recovered by 7% of max HP (activated once per battle).","upgrades":"Upgrade 1: Physical resistance changes to 45%, magic resistance changes to 45%, and HP recovery changes to 8.5% of max HP.  Upgrade 2: Physical resistance changes to 50%, magic resistance changes to 50%, and HP recovery changes to 10% of max HP. "}]},{"name":"Claire","alias":"Unyielding Belief","rarity":"Epic","type":"Human","class":"Defender","gearType":"STR","skills":[{"name":"St. Catherine's Holy Sword","skillType":"Ultimate","content":"Judge the enemy with the power of light. Deals damage equal to 250% of ATK + 250% of DEF to the nearest enemy and 2. 5m around it, and Stuns the target for 2 seconds.","upgrades":"Upgrade 1: Damage changes to 280% of ATK + 280% of DEF.  Upgrade 2: Damage changes to 310% of ATK + 310% of DEF. Stun duration changes to 3.5 seconds. "},{"name":"Noble Oath","skillType":"Main","content":"Grants sacred power to sword and shield. Increases Claire's ATK and DEF by 20% for 14 seconds. If Claire is under the effect of \"Revelation of Light, \" the buff disappears and she additionally recovers 14% of HP.","upgrades":"Upgrade 1: ATK and DEF increase changes to 24%, HP recovery effect changes to 16%.  Upgrade 2: ATK and DEF increase changes to 24%, HP recovery effect changes to 16%. Claire s normal attacks electrocute the enemy dealing Shock damage equal to 50% of ATK every 2 seconds for 6 seconds while the effect lasts. "},{"name":"Unfaltering Charge","skillType":"Sub","content":"Cuts the nearest enemy with flashing speed, dealing damage equal to 130% of ATK and stuns it for 2 seconds upon knocking it down. If under the \"Noble Oath\" buff, deals additional damage equal to 130% of DEF.","upgrades":"Upgrade 1: Damage changes to 140% of ATK, additional damage changes to 140% of DEF.  Upgrade 2: Damage changes to 150% of ATK, additional damage changes to 150% of DEF. "},{"name":"Protection of Faith","skillType":"Sub","content":"Spins the shield, dealing damage equal to 120% of DEF in a 1.5m circular area around you and increasing physical/magic resistance by 25% for 6 seconds. If under the \"Noble Oath\" buff, adds an effect that knocks the enemy down.","upgrades":"Upgrade 1: Damage changes to 130% of DEF, Physical/Magic Resistance increase changes to 27.5%.  Upgrade 2: Damage changes to 140% of DEF, Physical/Magic Resistance increase changes to 30%. If under the 'Noble Oath' buff, adds an effect that deals Shock damage equal to 50% of ATK every 2 seconds for 6 seconds. "},{"name":"Revelation of Light","skillType":"Passive","content":"Angel's blessing protects Claire. When Claire gets hit, a shield which absorbs damage equal to 15% of HP is created for 8 seconds, and she gets the \"Revelation of Light\" buff (cooldown 19 seconds).","upgrades":"Upgrade 1: Cooldown changes to 17 seconds.  Upgrade 2: Cooldown changes to 15 seconds. "}]},{"name":"Clara","alias":"Honey-Colored Sunlight","rarity":"Epic","type":"Beast","class":"Supporter","gearType":"STR","skills":[{"name":"Hole-in-one!!","skillType":"Ultimate","content":"Stops fighting for a moment and takes time to refresh. Recovers the HP of all allies by 60% of ATK and adds an effect which heals by 60% of ATK for 10 seconds.","upgrades":"Upgrade 1: Recovery changes to 65%, heal over time changes to 65%.  Upgrade 2: Recovery changes to 70%, heal over time changes to 70%. Allies are immune to status effects for 8 seconds. "},{"name":"Field at Noon","skillType":"Main","content":"The power of nature heals all allies. Restores HP of allies by 45% of ATK and continuously heals their HP by 45% of ATK every 2 seconds for 10 seconds.","upgrades":"Upgrade 1: Recovery changes to 50%, heal over time changes to 50%.  Upgrade 2: Recovery changes to 55%, heal over time changes to 55%. Allies are immune to status effects for 5 seconds. "},{"name":"You Should Not Steal","skillType":"Sub","content":"Strikes down the nearest enemy with the rake, dealing damage equal to 160% of ATK while stunning and pushing the enemy back for 1.5 seconds.","upgrades":"Upgrade 1: Damage changes to 175%.  Upgrade 2: Damage changes to 190%, Stun duration changes to 2.5 seconds. "},{"name":"Happiness Heals","skillType":"Sub","content":"Clara bites the apple she harvested to recover HP equal to 160% of her ATK, and increase ATK by 16% for 10 seconds.","upgrades":"Upgrade 1: Recovery changes to 165%, heal over time changes to 18%.  Upgrade 2: Recovery changes to 180%, heal over time changes to 20%. Adds an effect which removes 3 debuffs. "},{"name":"Plentiful Aura","skillType":"Passive","content":"Clara's healthy energy affects all allies. Clara's presence on the battlefield increases the DEF of all allies by 20%.","upgrades":"Upgrade 1: DEF increase changes to 24%.  Upgrade 2: DEF increase changes to 28%. "}]},{"name":"Dora","alias":"Almighty Teddy","rarity":"Epic","type":"Human","class":"Warrior","gearType":"STR","skills":[{"name":"Bearfoot Stomp","skillType":"Ultimate","content":"Enlarged Dora tramples the nearest enemy and enemies within 2.5m around it, dealing damage equal to 260% of ATK and stunning them for 2 seconds. If Dora's HP is 30% or less, deals additional damage equal to 160% of ATK.","upgrades":"Upgrade 1: Damage changes to 280%, additional damage changes to 170%.  Upgrade 2: Damage changes to 300%, additional damage changes to 180%. Addtional damage condition changes to 50% or less HP. "},{"name":"Bear Paw-ah Punch","skillType":"Main","content":"Puts all her might into a punch that deals damage equal to 220% of ATK to the nearest enemy. The punch deals additional damage equal to 160% of ATK and stuns the enemy for 2 sec when Dora's HP is 50% or less.","upgrades":"Upgrade 1: Damage changes to 240%, additional damage changes to 170%.  Upgrade 2: Damage changes to 260%, additional damage changes to 180%. Additional 180% damage is dealt if her HP is 20% or less. "},{"name":"Bear Knuckles","skillType":"Sub","content":"Punch full of torque deals damage equal to 180% of ATK to the nearest enemy. The punch deals additional damage equal to 100% of ATK when Dora's HP is 50% or less.","upgrades":"Upgrade 1: Damage changes to 190%, additional damage changes to 105%.  Upgrade 2: Damage changes to 200%, additional damage changes to 110%. Additional 110% damage is dealt if her HP is 20% or less. "},{"name":"Bear With Me","skillType":"Sub","content":"Become the Bear! Receive true damage equal to 60% of current HP, Crit DMG increases by 70% for 24 seconds. (Does not consume HP when it's below 50%.)","upgrades":"Upgrade 1: Crit DMG increase changes to 80%.  Upgrade 2: Crit DMG increase changes to 90%. ATK increases to 20%. "},{"name":"Bearly Alive","skillType":"Passive","content":"No armor stands in the way of a furious bear. All of Dora's attacks ignore 25% of enemy DEF. When her HP is 50% or less, DEF increases by 80%, Crit Rate increases by 30%, and received healing decreases by 50%.","upgrades":"Upgrade 1: DEF increase changes to 90%.  Upgrade 2: DEF increase changes to 100%. Crit Rate increase changes to 40%. "}]},{"name":"Erusha","alias":"Dancing Lightning","rarity":"Epic","type":"Undead","class":"Caster","gearType":"INT","skills":[{"name":"Dancing for Nirvana","skillType":"Ultimate","content":"Fires a barrage with Vajra. Deals damage equal to 220% ATK to the nearest enemy in a 4m wide and 6m long area, and deals 70% shock damage for 12 seconds.","upgrades":"Upgrade 1: Damage changes to 240% damage from shock changes to 75%  Upgrade 2: Damage changes to 260% damage from shock changes to 80% If a target is already shocked, the target will be stunned for 3 seconds. "},{"name":"Dance of Svarga","skillType":"Main","content":"Throws condensed chakra from the Vajra. Deals damage equal to 200% of ATK to the nearest enemy, and shocks enemy, dealing 60% damage for 12 seconds.","upgrades":"Upgrade 1: Damage changes to 220%, damage from shock changes to 65%  Upgrade 2: Damage changes to 240%, damage from shock changes to 70%. If a target is already shocked, the target will be stunned for 3 seconds. "},{"name":"Indra's Lightning","skillType":"Sub","content":"Sends Vajra to attack the enemy. Deals damage equal to 190% of ATK to the nearest enemy, and stuns the target for 2.5 seconds if the target is already shocked.","upgrades":"Upgrade 1: Damage changes to 205%.  Upgrade 2: Damage changes to 220%, Stun duration changes to 4 seconds. "},{"name":"Indra's Radiant Sphere","skillType":"Sub","content":"Throws a chunk of chakra. Deals damage equal to 100% of ATK to the nearest enemy, and shocks enemy, dealing 55% damage for 12 seconds.","upgrades":"Upgrade 1: Damage changes to 115%, damage from shock changes to 60%.  Upgrade 2: Damage changes to 130%, damage from shock changes to 65%. Shock damage penetrates 100% of the target's Magic Resistance. "},{"name":"Spinning Chakra","skillType":"Passive","content":"Absorbs the electricity running through the target, then converts it into chakra. Restores her Mana by 500 when her normal attack hits a shocked target.","upgrades":"Upgrade 1: Mana recovery changes to 600.  Upgrade 2: Mana recovery changes to 700. "}]},{"name":"Flynn","alias":"Frenzy Explosion","rarity":"Epic","type":"Beast","class":"Ranger","gearType":"DEX","skills":[{"name":"Hit the Machine and It Will Work","skillType":"Ultimate","content":"Flynn, engulfed in madness, fires a rocket, dealing damage equal to 330% of ATK to the nearest enemy and enemies within 2.5m around it, and stuns the target for 2 sec.","upgrades":"Upgrade 1: Damage changes to 360%.  Upgrade 2: Damage changes to 390%. Adds an effect which restores Mana by 3000. "},{"name":"Mmm, Gunpowder!","skillType":"Main","content":"Flynn, engulfed in madness, explodes Mr. Rocket, causing her normal attacks to explode and deal additional damage by the same amount as the normal attacks to targets within 2.5m for 10 seconds. Speed increases by 40% for 10 seconds.","upgrades":"Upgrade 1: Speed increase changes to 45%.  Upgrade 2: Speed increase changes to 50%. Adds an effect which removes all debuffs on self. "},{"name":"Take This!","skillType":"Sub","content":"Throws a grenade made with crude skills. Deals damage equal to 170% ATK to the farthest enemy, and launches the enemy 2m to the front.","upgrades":"Upgrade 1: Damage changes to 185%.  Upgrade 2: Damage changes to 200%. Adds an effect which stuns target for 2 sec. "},{"name":"Come on!","skillType":"Sub","content":"Fires a rocket filled with gunpowder, dealing damage equal to 150% ATK to the nearest enemy and enemies within 2.5m. If the \"Mmm, Gun Powder!\" buff is applied, the skill deals double the damage.","upgrades":"Upgrade 1: Damage changes to 160%.  Upgrade 2: Damage changes to 170%. If the \"Mmm. Gun Powder! buff is applied, the target's ATK is reduced by 20% for 5 seconds. "},{"name":"Better Alone!","skillType":"Passive","content":"Slow but deadly. Flynn's slow normal attacks deal 110% damage, and her ATK increases by 26% if there are no allies or enemies 3m around her.","upgrades":"Upgrade 1: Normal attack damage changes to 115%, ATK increase changes to 29%.  Upgrade 2: Normal attack damage changes to 120%, ATK increase changes to 32%. "}]},{"name":"Haru","alias":"Lonely but Deadly","rarity":"Epic","type":"Beast","class":"Striker","gearType":"DEX","skills":[{"name":"Solitude of the End","skillType":"Ultimate","content":"Charges with a single dagger. Deals damage equal to 370% ATK to the nearest enemy. If there is no enemy within 3m of the target, deals double the damage.","upgrades":"Upgrade 1: Damage changes to 400%.  Upgrade 2: Damage changes to 430%, deals damage penetrating 40% of the target's DEF. "},{"name":"White Molar of Death","skillType":"Main","content":"Quickly dashes to the nearest enemy, inflicting damage equal to 300% of ATK and stunning it for 3 seconds.","upgrades":"Upgrade 1: Damage changes tο 340%.  Upgrade 2: Damage changes tο 380%, deals damage penetrating 40% of the target's DEF. "},{"name":"Spinning Dagger","skillType":"Sub","content":"Scatters daggers around, dealing damage equal to 110% of ATK in a 2.5m circular area around you and making enemy bleed, dealing damage of 60% of ATK every 2 seconds for 8 seconds.","upgrades":"Upgrade 1: Damage changes to 120% bleeding damage changes to 65%.  Upgrade 2: Damage changes to 130% bleeding damage changes to 70%. Target's recovery while bleeding decreases by 50%. "},{"name":"Bleeding Claw","skillType":"Sub","content":"Deals damage equal to 130% ATK to nearby enemies within 2m by sharply scratching them. If the target is bleeding, deals additional damage equal to 90% of ATK.","upgrades":"Upgrade 1: Damage changes to 140%, additional damage changes to 95%.  Upgrade 2: Damage changes to 150%, additional damage changes to 100%. If the target is bleeding, the enemy's Mana recovery is reduced by 50% for 10 sec. "},{"name":"Pack Hunter","skillType":"Passive","content":"Beasts become stronger when they're together. Gains a special buff that increases the ATK of all allies by 24% when there are at least 2 allies within 3m around Haru.","upgrades":"Upgrade 1: ATK increase changes to 27%.  Upgrade 2: ATK increase changes to 30% "}]},{"name":"Jacqueline","alias":"Doll of Destruction","rarity":"Epic","type":"Undead","class":"Striker","gearType":"DEX","skills":[{"name":"Operation: Meteor Strike","skillType":"Ultimate","content":"Penetrates the atmosphere and strikes the battlefield. Moves towards the target with the lowest HP, then deals 220% to all enemies. The targeted enemy receives double the damage.","upgrades":"Upgrade 1: Damage changes to 240%.  Upgrade 2: Damage changes to 260%. Approaches the target with the lowest HP instead of approaching the nearest target, then stuns the target for 4 sec. "},{"name":"Strategy: Burst Harpoon","skillType":"Main","content":"Slams the ground, causing an explosion. Deals damage equal to 240% of ATK in a range of 1.8m wide and 6m long in front of a nearby enemy, and makes the enemy take 60% bleeding damage every 2 sec for 6 sec.","upgrades":"Upgrade 1: Damage changes to 260% bleeding, damage changes to 65%.  Upgrade 2: Damage changes to 280% bleeding, damage changes to 70% Bleeding, duration changes to 8 sec. "},{"name":"Strategy: Dark Moon","skillType":"Sub","content":"Accelerates the booster to attack the opponent's rear. Moves to the furthest enemy, dealing damage equal to 170% of ATK in a 2m radius circle. Also stuns the enemy for 3 seconds and stealths for 8 seconds. You cannot be taunted while stealthed.","upgrades":"Upgrade 1: Damage changes to 185% of ATK.  Upgrade 2: Damage changes to 200% of ATK. Adds an effect which decreases target's DEFENSE by 15%o 10 "},{"name":"Strategy: Crescent Moon","skillType":"Sub","content":"Attacks while drawing a semicircle with the tip of the toe. Deals damage equal to 150% of ATK to the nearest enemy and knocks it down, and makes the enemy take 55% bleeding damage every 2 sec for 6 sec.","upgrades":"Upgrade 1: Damage changes to 165%, bleeding damage changes to 60%.  Upgrade 2: Damage changes to 180% bleeding, damage changes to 65% Bleeding duration changes to 8 sec. "},{"name":"Thermoelectric Shield","skillType":"Passive","content":"Converts the heat generated from attacks into energy for defense. Using the skill generates a Residual Heat buff for 5 seconds. Under the Residual Heat buff, normal attacks create a protective shield with the capacity of absorbing 100% of ATK damage lasting for 12 seconds.","upgrades":"Upgrade 1: Shield HP changes to 110%.  Upgrade 2: Shield HP changes to 120%. Adds an effect which increases Evasion by 10 while the shield is active (The Evasion effect does not stack.) "}]},{"name":"Jade","alias":"Golden Chancellor","rarity":"Epic","type":"Human","class":"Caster","gearType":"INT","skills":[{"name":"Let the Forbidden Door Open","skillType":"Ultimate","content":"Shoots a light that turns enemies into gold from Jade's secret vault to inflict damage of 270% of ATK to all enemies and stuns them for 2 seconds. After that, for 12 seconds, the additional effect activation rate of all allies' skills is increased by 50%.","upgrades":"Upgrade 1: Damage changes to 295%.  Upgrade 2: Damage changes to 320%, the duration of additional skill activation rate increase 20 seconds. "},{"name":"Golden Loop","skillType":"Main","content":"Accelerates the jewel to inflict damage equal to 260% of ATK to the nearest enemy. Has a 30% chance to deal additional damage equal to 160% of ATK.","upgrades":"Upgrade 1: Damage changes to 280%, additional damage changes to 170%.  Upgrade 2: Damage changes to 300% additional damage changes to 180% Has 30% chance to add an effect that remove: 2 enemy buff(s). "},{"name":"Unrefusable Offer","skillType":"Sub","content":"There's nothing money cannot buy. Deals damage equal to 120% of ATK to the enemy with the highest ATK and Charms it to attack its allies for 6 seconds.","upgrades":"Upgrade 1: Damage changes to 140%.  Upgrade 2: Damage changes to 160%. Additionally, this skill cannot be avoided. "},{"name":"Jewel Bullet","skillType":"Sub","content":"Throws large and sharp jewel pieces to inflict damage equal to 160% of ATK to the nearest enemy. Has a 30% chance to deal additional damage equal to 110% of ATK.","upgrades":"Upgrade 1: Damage changes to 175%, additional damage changes to 115%.  Upgrade 2: Damage changes to 190%, additional damage changes to 120%. Has 30% chance to add an effect that removes 1 enemy buff(s). "},{"name":"Future Fortune","skillType":"Passive","content":"Her strong luck affects not only herself but also her surroundings. When Jade is on the battlefield, all allies gain a special buff that increases the activation rate of skill's additional effects by 20%.","upgrades":"Upgrade 1: Additional effect activation rate increase changes to 25%.  Upgrade 2: Additional effect activation rate increase changes to 30%. "}]},{"name":"Linzy","alias":"Lady Noir","rarity":"Epic","type":"Human","class":"Warrior","gearType":"DEX","skills":[{"name":"Moment of Twisted Fate","skillType":"Ultimate","content":"Approaches the enemy with the highest ATK and inflicts damage equal to 320% of ATK with a series of sword and gun attacks. If the \"Daze\" special buff is at 10 stacks or higher, deals additional damage equal to 100% of ATK and stuns the enemy for 4 seconds.","upgrades":"Upgrade 1: Damage changes to 340%, additional damage changes to 140%.  Upgrade 2: Damage changes to 360%, additional damage changes to 160% and if the \"Daze\" buff is at 20 stacks, this skill will always deal critical hits. "},{"name":"Avenging Sword","skillType":"Main","content":"Instantly moves to the rear of the enemy with the highest ATK, dealing damage equal to 250% of ATK. If the \"Daze\" special buff is at 10 stacks or higher, deals additional damage equal to 100% of ATK.","upgrades":"Upgrade 1: Damage changes to 270%, additional damage changes to 110%.  Upgrade 2: Damage changes to 290%, additional damage changes to 120% and stuns the target for 2 seconds. "},{"name":"Acrobatic Fire","skillType":"Sub","content":"Jumps into the air and attacks while dodging the enemy's attack. Deals damage equal to 170% of ATK to the nearest enemy and Linzy's Evasion increases by 30 for 18 seconds.","upgrades":"Upgrade 1: Damage changes to 190%.  Upgrade 2: Damage changes to 210% additionally increases Evasion by 20 for 6 seconds. "},{"name":"Blink and You'll Miss It","skillType":"Sub","content":"Instantly cuts the nearest enemy, dealing damage equal to 170% of ATK. If the \"Daze\" special buff is at 5 stacks or higher, deals additional damage equal to 90% of ATK.","upgrades":"Upgrade 1: Damage changes to 185%, additional damage changes to 100%.  Upgrade 2: Damage changes to 200%, additional damage changes to 110%. Adds an effect that decreases the enemy's DEF by 10% for 8 seconds. "},{"name":"Daze","skillType":"Passive","content":"Blinds the target who was hit by Linzy's attack with its thirst for revenge, provoking it to attack Linzy for 4 seconds while reducing its accuracy rate by 20. Obtains 2 stacks of \"Daze\" special buff that increases Crit DMG by 4% every time Linzy evades the enemy's attack (up to 20 stacks).","upgrades":"Upgrade 1: Crit DMG of the \"Daze\" special buff changes to 4.5% and when Linzy deals a normal attack gains 1 stack of the \"Daze\" special buff.  Upgrade 2: Crit DMG of the \"Daze\" special buff changes to 5%. "}]},{"name":"Mephistopeles","alias":"Operator One","rarity":"Epic","type":"Human","class":"Caster","gearType":"INT","skills":[{"name":"Spear of the Ark","skillType":"Ultimate","content":"Use the Arc's support bombardment. Deals damage equal to 260% ATK in a 4m area around the enemy with the highest ATK and additional damage equal to 150% ATK to targets in an analysis state.","upgrades":"Upgrade 1: Damage changes to 280%, additional damage changes to 170%.  Upgrade 2: Damage changes to 300%, additional damage changes to 190% Mephisto's ATK increases by 50% for 10 seconds after the attack. "},{"name":"Code: Overdrive","skillType":"Main","content":"Shoots a decomposing beam, dealing damage equal to 190% of ATK to the nearest target in a 2m straight area. Deals additional damage equal to 120% of ATK if the enemy is in analysis state.","upgrades":"Upgrade 1: Damage changes to 210%, additional damage changes to 135%.  Upgrade 2: Damage changes to 230%, additional damage changes to 150%. Adds an effect that decreases the target's DEF by 15% for 8 seconds. "},{"name":"Prism Ray","skillType":"Sub","content":"Shoots a prism beam, dealing 140% of ATK to the nearest enemy in a 2m straight area and decreasing the enemy's accuracy rate by 20 for 6 seconds.","upgrades":"Upgrade 1: Deals damage equal to 160% and adds an effect that deals additional damage equal to 100% of ATK if the enemy is in analysis state.  Upgrade 2: Damage changes to 180%, additional damage changes to 110%. "},{"name":"Code: Banish","skillType":"Sub","content":"Fixes the enemy with the highest ATK to the dimensional boundary and stuns it for 6 seconds.","upgrades":"Upgrade 1: Stun duration changes to 7 seconds.  Upgrade 2: Stun duration changes to 8 seconds, the target's incoming Crit DMG increases by 30% during the skill. "},{"name":"Multi-Dimensional Analysis","skillType":"Passive","content":"Analyzes all enemies' patterns and weaknesses to increase their chance to take Crits by 22% for 18 seconds.","upgrades":"Upgrade 1: Changes chance to take Crits to 26%.  Upgrade 2: Changes chance to take Crits to 30%. "}]},{"name":"Mica","alias":"Vivace Idol","rarity":"Epic","type":"Beast","class":"Striker","gearType":"STR","skills":[{"name":"Starlit Stage","skillType":"Ultimate","content":"Welcome to Mika's concert! Deals damage equal to 260% ATK to all enemies. When Seeha is on the battlefield, inflicts additional damage equal to 130% ATK and Stuns the enemy for 3 seconds.","upgrades":"Upgrade 1: Damage changes to 280% additional damage changes to 140%.  Upgrade 2: Damage changes to 300% additional damage changes to 150% and Stun duration changes to 4 seconds. "},{"name":"Music On","skillType":"Main","content":"Makes a powerful guitar sound. Deals damage equal to 210% of ATK to enemies within 3m. When Seeha is on the battlefield, deals additional damage equal to 70% of ATK.","upgrades":"Upgrade 1: Damage changes to 230%, additional damage changes to 80%.  Upgrade 2: Damage changes to 250% and additional damage changes to 90%, Stuns the target fo 3 seconds if Seeha is on the battlefield. "},{"name":"Stroke","skillType":"Sub","content":"Swing the guitar to deal damage equal to 140% of ATK to enemies within 2.5m. When Seeha is on the battlefield, deals additional damage equal to 70% and decreases target's ATK by 20% for 4 seconds.","upgrades":"Upgrade 1: Damage changes to 155%, additional damage changes to 75%.  Upgrade 2: Damage changes to 170%, additional damage changes to 80% and ATK reduction duration changes to 8 seconds. "},{"name":"Cute Live Performance","skillType":"Sub","content":"During \"Cute Live Performance\", deals damage equal to 220% ATK to enemies within 3m. When Seeha is on the battlefield, deals additional damage equal to 100% of ATK.","upgrades":"Upgrade 1: Damage changes to 230%, additional damage changes to 110%.  Upgrade 2: Damage changes to 240% and additional damage changes to 120%. Physical/magic resistance increases by 30% while the skills in use. "},{"name":"Alto Harmony","skillType":"Passive","content":"When Seeha is on the battlefield, Mica's ATK and DEF increase by 14% and all of her skills receive additional effects.","upgrades":"Upgrade 1: ATK and DEF increase changes to 17%.  Upgrade 2: ATK and DEF increase changes to 20%. "}]},{"name":"Miriam","alias":"Bullet Shower","rarity":"Epic","type":"Fairy","class":"Ranger","gearType":"DEX","skills":[{"name":"Eradicating Bullet","skillType":"Ultimate","content":"Deals damage equal to 320% of ATK to the nearest enemy in a straight 3m wide area and obtains 2 \"Magic Bullet\" special buffs (up to 7 stacks).","upgrades":"Upgrade 1: Damage changes to 345%.  Upgrade 2: Damage changes to 370%. Changes the number of Magic Bullet special buffs obtained to 4. "},{"name":"Exterminating Bullet","skillType":"Main","content":"Uses up all current Magic Bullet buffs to attack the nearest enemy. Each Magic Bullet deals damage equal 90% ATK.","upgrades":"Upgrade 1: Damage changes to 95%.  Upgrade 2: Damage changes to 100%. If there are 7 stacks of the Magic Bullet special buff, then the attack will hit as a critical hit. "},{"name":"Two Bullets","skillType":"Sub","content":"Shoots twice in a quick motion. Deals damage equal to 180% ATK to the nearest enemy and obtains 2 \"Magic Bullet\" special buffs (up to 7 stacks).","upgrades":"Upgrade 1: Damage changes to 200%.  Upgrade 2: Damage changes to 220%. Adds an effect which decreases the target's DEF by 15% for 8. "},{"name":"Fatal Shot","skillType":"Sub","content":"A powerful single bullet guarantees a critical hit, dealing damage equal to 170% ATK to the nearest enemy and obtains 2 \"Magic Bullet\" special buff (up to 7 stacks).","upgrades":"Upgrade 1: Damage changes to 185%.  Upgrade 2: Damage changes to 200%. Adds an effect which decreases the target's ATK by 15% for 8 "},{"name":"A Deal with Samiel","skillType":"Passive","content":"Tactical loading increases ATK by 26% for 10 seconds and obtains 3 \"Magic Bullet\" special buffs (up to 7 stacks).","upgrades":"Upgrade 1: ATK increase changes to 29%.  Upgrade 2: ATK increase changes to 32%. "}]},{"name":"Naiah","alias":"Sweet Dream","rarity":"Epic","type":"Fairy","class":"Caster","gearType":"INT","skills":[{"name":"To the Endless Dream","skillType":"Ultimate","content":"Lock your enemies in an eternal dream. Deals damage equal to 260% of ATK to all enemies and puts them to sleep for 4 seconds.","upgrades":"Upgrade 1: Damage changes to 285%.  Upgrade 2: Duration changes to 285%, sleep duration changes to 6. "},{"name":"Time to Say Good Night","skillType":"Main","content":"Sings a lullaby that induces unbearable sleep, dealing damage equal to 220% of ATK to the enemy with the highest ATK and 3m around the enemy. Inflicted targets are put to sleep for 4 seconds at a 50% chance.","upgrades":"Upgrade 1: Damage changes to 240%.  Upgrade 2: Damage changes to 260%, sleep duration changes to 6. "},{"name":"Dream-eating Fairy","skillType":"Sub","content":"Night's dream fairy, Max, eats up other's dreams. Deals damage equal to 140% of ATK to the enemy with the highest ATK. If the enemy is sleeping, absorbs HP equal to 12% of the target's max HP (the DMG proportion to HP cannot exceed 300% of Naiah's ATK).","upgrades":"Upgrade 1: Damage changes to 150%, HP absorption changes to 13%.  Upgrade 2: Damage changes to 160%, HP absorption changes to 14%, HP absorption ignores enemy DEF. "},{"name":"Deep Sleep","skillType":"Sub","content":"Dive into your dream. Attacks the enemy with the highest ATK, dealing damage equal to 130% of ATK, and puts it to sleep for 4 seconds at a 50% chance.","upgrades":"Upgrade 1: Damage changes to 140% of ATK.  Upgrade 2: Damage changes to 150% of ATK, Sleep duration changes to 6 seconds. "},{"name":"Dream Powder","skillType":"Passive","content":"Nailah's attacks make the enemy drowsy. Enemies attacked by Nailah's normal attack 7 times are put to sleep for 3.5 seconds.","upgrades":"Upgrade 1: The number of attacks changes to 6.  Upgrade 2: The number of attacks changes to 5. Sleep duration changes to 5 seconds. "}]},{"name":"Nicole","alias":"Forest Wind","rarity":"Epic","type":"Fairy","class":"Ranger","gearType":"DEX","skills":[{"name":"Inescapable Rain of Death","skillType":"Ultimate","content":"Nicole and Madori attack with a perfect combination. Deals damage equal to 220% of ATK around the nearest enemy in a 10m wide and 8m long area. Deals additional damage equal to 100% ATK if the target is under the \"Feather Brand\" effect.","upgrades":"Upgrade 1: Damage changes tο 240% additional damage changes to 100%.  Upgrade 2: Damage changes to 260%, additional damage changes to 100%. Additionally deals damage that ignores 20% of the target's DEF. "},{"name":"Storm","skillType":"Main","content":"Shoots Madori to deal damage equal to 100% ATK to the nearest enemy and enemies within 2. 5m. Deals additional damage equal to ATK if the target is under the \"Feather Brand\" effect.","upgrades":"Upgrade 1: Damage changes to 220%, additional damage changes to 110%.  Upgrade 2: Damage changes to 240%, additional damage changes to 120%. Additionally deals damage that ignores 20% of the target's DEF. "},{"name":"Sharp Feathers","skillType":"Sub","content":"Throws a Madori feather forward, dealing damage equal to 130% ATK in a 8m long, 30 degree conical area and casts the \"Feather Brand\" effect which decreases Evasion by 30 for 14 seconds.","upgrades":"Upgrade 1: Damage changes to 145%.  Upgrade 2: Damage changes to 160%. Additionally deals damage that penetrates 20%. "},{"name":"Merciless Raptor's Hunt","skillType":"Sub","content":"Shoots Madori to deal damage equal to 150% ATK in a 1.5m wide and 11m long straight line towards the nearest enemy. Deals additional 140% damage if the target is under the \"Feather Brand\" effect.","upgrades":"Upgrade 1: Damage changes to 150%, additional damage changes to 85%.  Upgrade 2: Damage changes to 160%, additional damage changes to 90%. Additionally deals damage that penetrates 20%. "},{"name":"Unerring Arrow","skillType":"Passive","content":"Nicole's arrows do not give you the option to avoid them. Nicole's Accuracy increases by 50 and all attacks deal damage that ignore 30% of the target's DEF.","upgrades":"Upgrade 1: Accuracy increase changes to 60.  Upgrade 2: Accuracy increase changes to 70. Nicole's normal attacks deal damage that ignores an additional 20% of the target's DEF. "}]},{"name":"Nini","alias":"Gap of Yin and Yang","rarity":"Epic","type":"Undead","class":"Caster","gearType":"INT","skills":[{"name":"Clash of the Universe","skillType":"Ultimate","content":"Throws countless amount of sealing charms. Deals damage equal to 270% ATK to the nearest enemy and 2.5m area around it, and silences the target for 10 seconds.","upgrades":"Upgrade 1: Damage changes to 300%.  Upgrade 2: Damage changes to 330%. Silence duration changes to 12 seconds. "},{"name":"Ying Yang Bagua Zhang","skillType":"Main","content":"Sends out a huge Star Discus. Deals damage equal to 160% of ATK in a 2.5m wide and 6.5m long area in front of the nearest enemy and deals burning or freezing damage equal to 55% ATK every 2 sec for 10 sec.","upgrades":" Upgrade 1: Damage changes to 170% burning and freezing damage changes to 60%.  Upgrade 2: Damage changes to 180% burning and freezing damage changes to 65% duration changes to 12. "},{"name":"Star Discus","skillType":"Sub","content":"Gently throws a small Star Discus. Deals damage equal to 160% ATK to the nearest enemy and decreases its Magic Resistance by 25% for 10 seconds.","upgrades":"Upgrade 1: Damage changes to 175%.  Upgrade 2: Damage changes to 190%. Magic Resistance decrease changes to 35%. "},{"name":"Amulet of Seal","skillType":"Sub","content":"Throws a sealing charm. Deals damage equal to 170% of ATK to the nearest enemy and silences it for 8 seconds.","upgrades":"Upgrade 1: Damage changes to 185%.  Upgrade 2: Damage changes to 200% Silence. Duration changes to 10 seconds "},{"name":"Amulet of Protection","skillType":"Passive","content":"Nini's amulet gathers Mana. Gains a special buff that restores Mana by 220 every 2 seconds until the end of the battle.","upgrades":"Upgrade 1: Mana recovery changes to 260.  Upgrade 2: Mana recovery changes to 300. Adds an effect which restores 3% HP. "}]},{"name":"Petra","alias":"Guide of the Dead","rarity":"Epic","type":"Undead","class":"Defender","gearType":"STR","skills":[{"name":"UnderWorld Keeper's Evil Eyes","skillType":"Ultimate","content":"Activates Petra's evil eyes, dealing damage equal to 10% of her max HP to all enemies. removes up to 2 buff effects, and Petra recovers HP equal to damage dealt (damage cannot be greater than 300% of Petra's ATK),","upgrades":"Upgrade 1: Damage changes to 12%.  Upgrade 2: Damage changes to 14%. Changes the number of buffs removed to 3. "},{"name":"Energy Absorption","skillType":"Main","content":"Recovers HP by absorbing the surrounding energy. Absorbs HP equal to 12% of the max HP of each enemy within 3m (damage cannot be greater than 300% of Petra's ATK).","upgrades":"Upgrade 1: HP absorption changes to 14%.  Upgrade 2: HP absorption changes to 16%. Absorbs 2 times the HP if there is only one enemy within 3m. "},{"name":"Soul Extortion","skillType":"Sub","content":"Extorts the soul of the enemy with the highest ATK and locks it up in the lantern. The target takes 30% of the damage Petra receives for 18 seconds. Soul Extortion is unavoidable.","upgrades":"Upgrade 1: Damage transfer changes to 35%.  Upgrade 2: Damage transfer changes to 40%. Targets affected by Soul Extortion will attack Petra throughout the duration. "},{"name":"Soul Release","skillType":"Sub","content":"Releases the lamp-bound soul, granting a shield that absorbs damage equal to 140% of Petra's ATK for 12 seconds to all allies.","upgrades":"Upgrade 1: Shield HP changes to 160%.  Upgrade 2: Shield HP changes to 180%. Adds an effect which decreases the ATK of enemies within 2.5m by 10% 8 seconds "},{"name":"Fickle Grave Keeper","skillType":"Passive","content":"If there is no ally within 2.5m around Petra, the Lonely Grave Keeper special buff will increase DEF by 60%. If there is an ally within that range, the Grave Keeper's Bond special buff will increase ATK by 30%.","upgrades":"Upgrade 1: Lonely Grave Keeper buff effect's DEF increase changes to 70%, Grave Keeper's Bond buff effect's ATK increase changes to 35%  Upgrade 2: Lonely Grave Keeper buff effect's DEF increase changes to 80%, Grave Keeper's Bond buff effect's ATK increase changes to 40,% Immune to status effects andknockback effects while Lonely Grave Keepers active. "}]},{"name":"Prim","alias":"Phantom Rainbow","rarity":"Epic","type":"Undead","class":"Supporter","gearType":"INT","skills":[{"name":"Finale: Where Did the Rabbit Go?","skillType":"Ultimate","content":"A giant rabbit doll steps on the enemy, inflicting damage equal to 320% of ATK in a 3m circular area to the nearest enemy and those around it, stunning it for 3 seconds.","upgrades":"Upgrade 1: Damage changes to 345%.  Upgrade 2: Damage changes to 370%. Stun duration changes to 4.5 seconds. "},{"name":"Wanna See a Magic Trick?","skillType":"Main","content":"Draws a lucky card, restoring the HP equal to 260% of ATK for all allies and removing 2 debuff effect(s).","upgrades":"Upgrade 1: HP recovery changes to 280%.  Upgrade 2: HP recovery changes to 300%. Removes 3 debuff effect(s) from the target. "},{"name":"Will There Be Pigeons?","skillType":"Sub","content":"Sends off a flock of white pigeons. Targets the ally with lowest HP and recovers HP by 130% ATK in a 1.8m wide 8m line, and deals damage equal to 130% ATK toe enemies in the target area.","upgrades":"Upgrade 1: Recovery changes to 145%, damage changes to 145%.  Upgrade 2: Recovery changes to 160%, damage changes to 160% Increases the target ally's DEF by 10% and reduces the enemy's DEF by 10% 8 seconds. "},{"name":"Abracadabra","skillType":"Sub","content":"Tada! Boosts the morale by showing a surprise magic using a hat. Increases the ATK of allies in a 3m circular area around you by 20% for 9 seconds.","upgrades":"Upgrade 1: ATK increase changes to 22.5%.  Upgrade 2: ATK increase changes to 25%, duration of effect changes to 12 seconds. "},{"name":"Trick","skillType":"Passive","content":"Mesmerizes enemies with flashy magic to hinder their attacks. While Prim is on the battlefield, the chance of allies getting hit by critical hits decreases by 20%.","upgrades":"Upgrade 1: Chance of allies getting hit by critical hits decrease changes to 22.5%  Upgrade 2: Chance of allies getting hit by critical hits decrease changes to 25%. "}]},{"name":"Rebecca","alias":"Immortal Spring","rarity":"Epic","type":"Undead","class":"Ranger","gearType":"DEX","skills":[{"name":"Deadly Purple Injection","skillType":"Ultimate","content":"Medicines can't always be good for you. Deals damage equal to 220% ATK to enemies in a 1.8m wide and 8m long area to the nearest enemy, and poisons them, dealing 75% damage every 2 seconds for 12 seconds. Target's healing received decreases 75% while poisoned.","upgrades":"Upgrade 1: Damage changes to 240%, poison damage changes to 80%.  Upgrade 2: Damage changes to 260%, poison damage changes to 85%, poisoned duration changes to 14 seconds. "},{"name":"Yellow Anti-Recovery Injection","skillType":"Main","content":"Shoots pressurized sap, deals damage equal to 180% ATK to enemies in a 1.8m wide and 8m long area to the nearest enemy, and poisons them, dealing 60% damage every 2 seconds for 12 seconds. Target's healing received decreases 50% while poisoned.","upgrades":"Upgrade 1: Damage changes to 200%, poison damage changes to 65%.  Upgrade 2: Damage changes to 220%, poison damage changes to 70%, poisoned duration changes to 14 seconds. "},{"name":"Toxic Sap","skillType":"Sub","content":"Spits out toxic sap. Deals damage equal to 70% ATK to all enemies in a 1.8m wide 8m long area from the nearest enemy and poisons them, dealing 50% damage every 2 seconds for 12 seconds.","upgrades":"Upgrade 1: Damage changes to 80%, poison damage changes to 55%.  Upgrade 2: Damage changes to 90%, poison damage changes to 60%, poisoned duration changes to 14 seconds. "},{"name":"Synthetic Adrenaline","skillType":"Sub","content":"Activates allies' nerves. Increases the Speed of the farthest ally by 20% and the ATK by 20% for 10 seconds.","upgrades":"Upgrade 1: Speed increase changes to 22.5%, ATK increase changes to 22.5%.  Upgrade 2: Speed increase changes to 25%, ATK increase changes to 25%. Adds an effect which restores Mana by 250 every 2 seconds. "},{"name":"Aggravating Wounds","skillType":"Passive","content":"Deepens the wounds of wounded enemies. Increases the DoT on enemies by 35% while Rebecca is on the battlefield.","upgrades":"Upgrade 1: DoT increase effect changes to 42.5%.  Upgrade 2: DoT increase effect changes to 50%. "}]},{"name":"Renee","alias":"Silver Reflection","rarity":"Epic","type":"Fairy","class":"Striker","gearType":"STR","skills":[{"name":"Supercompressed Energy Burst","skillType":"Ultimate","content":"Forcefully condenses energy then shoots it to the nearest enemy, dealing damage equal to 300% of ATK and pushing the enemy far away. Deals 150% additional damage if the \"Gear Up\" buff is active.","upgrades":"Upgrade 1: Damage changes to 320%, additional damage changes to 160%.  Upgrade 2: Damage changes to 340%, additional damage changes to 170%. Adds an effect which stuns the target fo 4 seconds if the \"Gear Up\" buff is active, "},{"name":"Machine Gun Punch","skillType":"Main","content":"With a series of strikes at the speed of light, deals damage equal to 250% ATK to the nearest enemy and knocks it down. Deals 120% additional damage if the \"Gear Up\" buff is active.","upgrades":"Upgrade 1: Damage changes to 260%, additional damage changes to 130%.  Upgrade 2: Damage changes to 280%, additional damage changes to 140%. Adds an effect which stuns the target for 3 seconds if the \"Gear Up\" buff is active. "},{"name":"Shockwave Punch","skillType":"Sub","content":"Explodes a sphere, inflicting damage equal to 160% ATK in 5m long, 45 degree conical area in front of you and decreasing Mana by 800. Deals additional damage equal to 80% ATK if the \"Gear Up\" buff is active.","upgrades":"Upgrade 1: Damage changes to 175% additional damage changes to 85%.  Upgrade 2: Damage changes to 190% additional damage changes to 90%. Mana decrease changes to 1600. "},{"name":"Magnum Punch","skillType":"Sub","content":"Adjusts the physical ability to apply a quick consecutive attack. Deals damage equal to 170% of ATK to the nearest enemy and increases her Speed by 20% for 14 seconds.","upgrades":"Upgrade 1: Damage changes to 185%.  Upgrade 2: Damage changes to 200%. Adds an effect which decreases the target's Speed by 20% for 10. "},{"name":"Gear Up","skillType":"Passive","content":"If Renee has a buff that increases Speed, then ATK increases by 29% and Evasion increases by 29.","upgrades":"Upgrade 1: ATK increase changes to 32% Evasion changes to 32.  Upgrade 2: ATK increase changes to 35% Evasion changes to 35. "}]},{"name":"Seeha","alias":"Blue Prelude","rarity":"Epic","type":"Beast","class":"Supporter","gearType":"DEX","skills":[{"name":"Moonlit Stage","skillType":"Ultimate","content":"Finally, Seeha's concert comes true! Recovers the HP of all allies by 180% of ATK. When Mica is on the battlefield, continuously recovers HP by 40% of ATK for 6 seconds.","upgrades":"Upgrade 1: Recovery changes to 195% of ATK, continuous recovery changes to 65% of ATK.  Upgrade 2: Recovery changes to 210% of ATK. continuous recovery changes to 70% of ATK. When Mica is on the battlefield, additionally increases DEF of allies by 30% 10 seconds. "},{"name":"Music On","skillType":"Main","content":"With Sheena's clear voice, restores the HP of allies within a range of 3m by 150% of ATK. When Mica is on the battlefield, continuously recovers HP by 40% of ATK every 2 seconds for 6 seconds.","upgrades":"Upgrade 1: Recovery changes to 160%, heal over time changes to 45%.  Upgrade 2: Recovery changes to 170%, heal over time changes to 50%. Adds an effect which increases target's DEF by 20% for 10 seconds while Mica is on the battlefield. "},{"name":"Mic Check","skillType":"Sub","content":"Screams a high note into the microphone, dealing damage equal to 130% of ATK in a 2.5m area. When Mica is on the battlefield, inflicts additional damage equal to 70% of ATK and silences the enemy for 5 seconds.","upgrades":"Upgrade 1: Damage changes to 145%, additional damage changes to 75%.  Upgrade 2: Damage changes to 160%, additional damage changes to 80% and Silence duration changes 8 seconds. "},{"name":"Happy Live Performance","skillType":"Sub","content":"During \"Happy Live:Performance,\" recovers the HP of allies within a 3m area equal to 1.50% of ATK. When Mica is on the battlefield, additionally recovers their HP by 70% of ATK.","upgrades":"Upgrade 1: Recovery changes to 160%, additional recovery changes to 75%.  Upgrade 2: Recovery changes to 170%. additional recovery changes to 80%. Physical/magic resistance increases by 30% while the skill is in use. "},{"name":"Soprano Harmony","skillType":"Passive","content":"When Mica is on the battlefield, Sheena's ATK and DEF increase by 14% and all of her skills receive additional effects.","upgrades":"Upgrade 1: ATK and DEF increase changes to 17%.  Upgrade 2: ATK and DEF increase changes to 20%. "}]},{"name":"Soonie","alias":"Water Roar","rarity":"Epic","type":"Beast","class":"Defender","gearType":"STR","skills":[{"name":"Seek to Live Only to Die","skillType":"Ultimate","content":"Summons a ship to deal damage equal to 400% of DEF to the nearest enemy and enemies within 3.5m of the target and removes all of the enemy's buffs.","upgrades":"Upgrade 1: Damage changes to 440%.  Upgrade 2: Damage changes to 480%. Adds an effect which decreases the target's ATK by 20% for 12 sec. "},{"name":"Onboard Crossfire","skillType":"Main","content":"Receives support fire from the ship. Deals damage equal to 230% of DEF in a range of 7m wide and 6.5m long to the farthest enemy and taunts the target for 12 seconds.","upgrades":"Upgrade 1: Damage changes tο 255%.  Upgrade 2: Damage changes to 280%. Adds an effect which decreases the target's ATK by 25% for 12 seconds. "},{"name":"Spiral Shield Dance","skillType":"Sub","content":"Spins the shield towards the nearest enemy, dealing damage equal to 170% of DEF, and knocks the enemy down. Creates a shield which absorbs damage equal to 16% of HP for 12 seconds.","upgrades":"Upgrade 1: Damage changes to 185% of DEF, shield changes to 18%  Upgrade 2: Damage changes to 200% of DEF, shield changes to 20%. Adds an effect which increases her DEF by 30% for 12 seconds. "},{"name":"Zero-Range Bombardment","skillType":"Sub","content":"Fires a gravity cannon to inflict damage equal to 180% of DEF in a 2.2m wide and 4.8m long area to the nearest enemy, and removes 2 target buffs.","upgrades":"Upgrade 1: Damage changes to 200%.  Upgrade 2: Damage changes to 220%. Adds an effect which decreases the target's ATK by 20% for 6 seconds. "},{"name":"Immortal Symbol","skillType":"Passive","content":"A formidable enemy may wound you, but you shall never fall. Increases the heal over time effect for all allies by 30% while Soonie is in battle.","upgrades":"Upgrade 1: Heal over time effect increase changes to 35%.  Upgrade 2: Heal over time effect increase changes to 40%. "}]},{"name":"Talia","alias":"Terrestrial Star","rarity":"Epic","type":"Fairy","class":"Supporter","gearType":"INT","skills":[{"name":"Star's Arrival Day","skillType":"Ultimate","content":"With the power of the 7 stars that protect Talia, deals damage equal to 250% of ATK to all enemies, and knocks them down. The power of the stars restore the HP of all allies by 2% of Talia's max HP every 2 seconds for 8 seconds, and continuously restores Mana by 200.","upgrades":"Upgrade 1: Damage changes to 280%.  Upgrade 2: Damage changes to 310%, HP recovery changes to 3%, Mana recovery changes to 300. "},{"name":"Tell Me Your Zodiac Sign","skillType":"Main","content":"The power of the stars restore the HP of all allies by 2,5% of Talia's max HP every 2 seconds for 8 seconds, continuously restores Mana by 250, and removes 1 debuff.","upgrades":"Upgrade 1: HP recovery changes to 3%, Mana recovery changes to 300.  Upgrade 2: HP recovery changes to 3.5%, Mana recovery changes to 350. The number ofdebuffs removed changes to 2. "},{"name":"Greet the Stars","skillType":"Sub","content":"Gives star's protection to allies. Absorbs damage equal to 12% of Talia's max HP for 10 seconds from the farthest ally and grants a shield effect that increases DEF by 10%.","upgrades":"Upgrade 1: Shield HP changes to 14%.  Upgrade 2: Shield HP changes to 16%, Restores the target's HP by 8% of Talia's max HP for 10 seconds. "},{"name":"Attention to the Stars","skillType":"Sub","content":"Emits light like a shining star, inflicting damage equal to 140% ATK in a 5m long, 90 degree conical area in front of the nearest enemy and blinds the enemy, reducing its Accuracy by 20 for 8 seconds.","upgrades":"Upgrade 1: Damage changes to 150%.  Upgrade 2: Damage changes to 160%, Adds an effect which removes 1 buff from the target. "},{"name":"Stars Are Watching","skillType":"Passive","content":"The starlight energizes the allies. Increases ATK and DEF of all allies by 10% while Talia is on the battlefield.","upgrades":"Upgrade 1: ATK and DEF increase changes to 11.5%.  Upgrade 2: ATK and DEF increase changes to 13%. "}]},{"name":"Violette","alias":"Breath of Disaster","rarity":"Epic","type":"Undead","class":"Caster","gearType":"INT","skills":[{"name":"A Thousand Disasters and One Hope","skillType":"Ultimate","content":"She finds hope among the disasters. Deals damage equal to 140% of ATK to the nearest enemy and 3m around it, and deals additional 140% damage as many times as the number of DoT effects casted on the the target (burn, freeze, shock, poison, bleed, curse). Restores her HP equal to 300% of ATK and removes all debuff effects.","upgrades":"Upgrade 1: Damage changes to 150%, additional damage changes to 150%.  Upgrade 2: Damage changes to 160%, additional damage changes to 160% and recovery changes to 500%. "},{"name":"Destructive Seduction","skillType":"Main","content":"Deals damage by intensifying all disastrous effects casted on the target. Deals damage equal to 140% of ATK to the nearest enemy, and additionally deals 140% damage as many times as the number of DoT effects castle on the target (burn, freeze, shock, poison, bleed, curse).","upgrades":"Upgrade 1: Damage changes to 150%, additional damage changes to 150%.  Upgrade 2: Damage changes to 160%, additional damage changes to 160%. Charms the target fo 6 seconds if the target is cursed. "},{"name":"Whispering Curse","skillType":"Sub","content":"Gives a life-destroying curse disease. Deals damage equal to 90% ATK to the nearest enemy, and puts a curse that deals damage equal to 60% ATK every 2 seconds for 12 seconds on the enemy.","upgrades":"Upgrade 1: Damage changes to 100%, DoT changes to 65%.  Upgrade 2: Damage changes to 110%, DoT changes to 70%. Duration changes to 14 seconds. "},{"name":"Bell of Decline","skillType":"Sub","content":"Rings the Bell of Decline and makes enemies lose the will to fight. Reduces the ATK of the nearest enemy by 18% and DEF by 18% for 10 seconds. Also removes 1 buff effect.","upgrades":"Upgrade 1: ATK decrease changes to 21%, DEF changes to 21%.  Upgrade 2: ATK decrease changes to 24%, DEF changes to 24%. The number of buff effects removed changes to 2. "},{"name":"Absorbing Disasters","skillType":"Passive","content":"Becomes powerful by absorbing disasters. When Violette hits targets under a DoT effect (burn, freeze, shock, poison, bleed, curse) with her normal attacks, ATK increases by 1.5% as many times as the number of effects applied (up to 50 stacks).","upgrades":"Upgrade 1: ATK increase changes to 1.75%.  Upgrade 2: ATK increase changes to 2%. "}]},{"name":"Vivienne","alias":"Emerald Wizard","rarity":"Epic","type":"Fairy","class":"Caster","gearType":"INT","skills":[{"name":"Giant Destroyer of All Things","skillType":"Ultimate","content":"Summons a storm, dealing damage equal to 260% of ATK to the nearest enemy and 4m around the enemy, and then launches the enemy into the air. Also deals additional damage equal to 90% of ATK as many as the number of \"Wind Blade\" buffs.","upgrades":"Upgrade 1: Damage changes 280%. Additional damage changes to 95%.  Upgrade 2: Damage changes 300%. Additional damage changes to 100%. "},{"name":"Cutting Wind Blade","skillType":"Main","content":"Create and throw a blade of wind. Deals damage equal to 180% of ATK in a 1.5m wide straight line to the nearest enemy and obtains the \"Wind Blade\" buff which increases Crit Rate by 5% (up to 3 stacks). Also deals additional damage equal to 90% of ATK as many as the number of Wind Blade buffs.","upgrades":"Upgrade 1: Damage changes to 190%, additional damage changes to 95%.  Upgrade 2: Damage changes to 200%, additional damage changes to 100%. Max number of \"Wind Blade\" stacks changes to 4 stacks. "},{"name":"Snow Eater","skillType":"Sub","content":"Applies Snow Eater to the ally farthest away from Vivienne for 8 sec, which deals damage equal to 60% every 2 seconds to enemies within 2.5m of the ally.","upgrades":"Upgrade 1: Damage changes to 70%.  Upgrade 2: Damage changes tο 80%. Increases the target's ATK by 15% during the duration. "},{"name":"Westerly","skillType":"Sub","content":"Grants the wind's grace, increasing the Speed of all allies by 15% for 10 seconds. Additionally increases Vivienne's ATK by 15%.","upgrades":"Upgrade 1: Speed increase changes to 17.5%, ATK changes to 17.5%.  Upgrade 2: Speed increase changes to 20%, ATK changes to 20%. Vivienne's Speed additional increases by 10%. "},{"name":"Endless Mana","skillType":"Passive","content":"Mana endlessly overflow. Vivienne's Mana recovery increases by 22%.","upgrades":"Upgrade 1: Mana recovery increase changes to 26%.  Upgrade 2: Mana recovery increase changes to 30%. "}]}]